[{"article_title": "Spyware Disguises as Android Applications on Google Play", "date_published": "2019-01-03T04:58:00", "short_description": "Spyware disguised itself as legitimate Android applications to steal information from users. Some malicious apps were already downloaded over 100,000 times by users from all over the world. ", "article_link": "https://blog.trendmicro.com/trendlabs-security-intelligence/spyware-disguises-as-android-applications-on-google-play/", "author": "", "source": "Trend Micro"}, {"article_title": "With Mirai Comes Miori: IoT Botnet Delivered via ThinkPHP Remote Code Execution Exploit", "date_published": "2018-12-20T04:55:00", "short_description": "We analyzed another Mirai variant called “Miori,” which is being spread through a Remote Code Execution (RCE) vulnerability in the PHP framework, ThinkPHP. Aside from Miori, several known Mirai variants like IZ1H9 and APEP were also spotted using the same RCE exploit for their arrival method. The aforementioned variants all use factory default credentials via Telnet to brute force their way in and spread to other devices.", "article_link": "https://blog.trendmicro.com/trendlabs-security-intelligence/with-mirai-comes-miori-iot-botnet-delivered-via-thinkphp-remote-code-execution-exploit/", "author": "", "source": "Trend Micro"}, {"article_title": "Android Wallpaper Apps Found Running Ad Fraud Scheme", "date_published": "2018-12-19T04:47:00", "short_description": "Analyzed 15 malicious wallpaper apps we found on Google Play Store running click ad fraud schemes. The apps recorded over 200,000 downloads worldwide — our telemetry shows infection to be the highest in some countries in Europe, the US, and Asia — before they were removed. ", "article_link": "https://blog.trendmicro.com/trendlabs-security-intelligence/android-wallpaper-apps-found-running-ad-fraud-scheme/", "author": "", "source": "Trend Micro"}, {"article_title": "URSNIF, EMOTET, DRIDEX and BitPaymer Gangs Linked by a Similar Loader", "date_published": "2018-12-18T04:51:00", "short_description": "We analyzed samples of EMOTET, URSNIF, DRIDEX and BitPaymer and found similar payload loaders and internal data structures, possibly implying that these different groups are familiar with and are working closely together.", "article_link": "https://blog.trendmicro.com/trendlabs-security-intelligence/ursnif-emotet-dridex-and-bitpaymer-gangs-linked-by-a-similar-loader/", "author": "", "source": "Trend Micro"}, {"article_title": "Cybercriminals Use Malicious Memes that Communicate with Malware", "date_published": "2018-12-14T05:00:00", "short_description": "Steganography, or the method used to conceal a malicious payload inside an image to evade security solutions, has long been used by cybercriminals to spread malware and perform other malicious operations. We recently discovered malicious actors using this technique on memes. The malware authors have posted two tweets featuring malicious memes on October 25 and 26 via a Twitter account created in 2017. The memes contain an embedded command that is parsed by the malware after it’s downloaded from the malicious Twitter account onto the victim’s machine, acting as a C&C service for the already- placed malware. It should be noted that the malware was not downloaded from Twitter and that we did not observe what specific mechanism was used to deliver the malware to its victims.", "article_link": "https://blog.trendmicro.com/trendlabs-security-intelligence/cybercriminals-use-malicious-memes-that-communicate-with-malware/", "author": "", "source": "Trend Micro"}]